src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура СК_ПриОткрытииПослеНаСервере()
	ТабЯчейки.Очистить();
	ТабЯчейки.Загрузить(СК_ОстаткиЯчейки.ОстатокПоЯчейкам(Объект.Ссылка)); 
	ЭтаФорма.Склад = Справочники.Склады.НайтиПоНаименованию("Основной склад");
	ЗаполнитьОстатокПоСкладу();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстатокПоСкладу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличииОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	ТоварыНаСкладахОстатки.Склад = &Склад
	               |	И ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура";  
	Запрос.УстановитьПараметр("Склад",ЭтаФорма.Склад.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура",Объект.Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		ЭтаФорма.Элементы.ОстатокНаСкладе.Заголовок = Строка(Рез.ВНаличииОстаток) + " шт";
	Иначе                                            
		ЭтаФорма.Элементы.ОстатокНаСкладе.Заголовок = " 0 шт";
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура СК_ПриОткрытииПосле(Отказ)
	СК_ПриОткрытииПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СК_СкладПриИзмененииПосле(Элемент)
	ЗаполнитьОстатокПоСкладу();
КонецПроцедуры
